# игровое меню

main_window = r"""
 /#/====== МОРСКОЙ БАТЛ ======\#\
|#/        ГЛАВНОЕ МЕНЮ        \#\
|/                              \|
||          1. ИГРАТЬ           ||
||          2. ПРАВИЛА          ||
||          3. ВЫЙТИ            ||
||                              ||
|\                              /|
|#\    4. Авторы  5. Донат     /#|
 \#\    *введите команду      /#/
  \#\========================/#/
"""

rule_window = r"""
 /#/====== МОРСКОЙ БАТЛ ======\#\
|#/          ПРАВИЛА          \#\
|/                              \|
||  Ход осуществляется вводом   ||
||  формата: а2, б7, и3.        ||
||  Цель потопить все корабли   ||
||  противника.                 ||
|\                              /|
|#\    Нажмите Enter для       /#|
 \#\   выхода в главное меню  /#/
  \#\========================/#/
"""


creator_window = r"""
 /#/====== МОРСКОЙ БАТЛ ======\#\
|#/           АВТОРЫ           \#\
|/   главные айтишники:         \|
||        Яковлев Даниил        ||
||        Суранов Михаил        ||
||   дайте им офер в яндекс:    ||
||        Яковлев Даниил        ||
|\        Суранов Михаил        /|
|#\    Нажмите Enter для       /#|
 \#\   выхода в главное меню  /#/
  \#\========================/#/
"""

donat_window = r"""
 /#/====== МОРСКОЙ БАТЛ ======\#\
|#/           ДОНАТ            \#\
|/                              \|
||                              ||
||        В РАЗРАБОТКЕ.         ||
||             :(               ||
||                              ||
|\                              /|
|#\    Нажмите Enter для       /#|
 \#\   выхода в главное меню  /#/
  \#\========================/#/
"""


def main_menu() -> None: # выводит главное меню
    print(main_window)

def rule_menu() -> None:
    print(rule_window)

def creator_menu() -> None:
    print(creator_window)

def donat_menu() -> None:
    print(donat_window)



