# игровое меню

main_window = r"""
 /#/====== МОРСКОЙ БАТЛ ======\#\
|#/        ГЛАВНОЕ МЕНЮ        \#\
|/                              \|
||          1. ИГРАТЬ           ||
||          2. ПРАВИЛА          ||
||          3. ВЫЙТИ            ||
||                              ||
|\                              /|
|#\    4. Авторы  5. Донат     /#|
 \#\    *введите команду      /#/
  \#\========================/#/
"""

rule_window = r"""
 /#/====== МОРСКОЙ БАТЛ ======\#\
|#/          ПРАВИЛА          \#\
|/                              \|
||  Ход осуществляется вводом   ||
||  формата: а2, б7, и3.        ||
||  Цель потопить все корабли   ||
||  противника.                 ||
|\                              /|
|#\    Нажмите Enter для       /#|
 \#\   выхода в главное меню  /#/
  \#\========================/#/
"""


def main_menu() -> None: # выводит главное меню
    print(main_window)

def rule_menu() -> None:
    print(rule_window)



